#include <iostream>
#include <string>
#include <map>
#include <windows.h>


int main() {
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	std::cout << "Задание №1\n";
	//Дерево двоичного поиска — это структура данных, которая позволяет быстро работать с отсортированном списком чисел.
	//n это количество узлов в бинарном дереве
	//Следовательно, количество поисков, которые нужно выполнить, -это количество узлов дерева. Поиск,удаление и вставка происходит по ключу, 
	//поэтому занимает одинаковую сложность О(log(N))	 
	std::cout << "Задание №2\n";
	
	//Методы класса нужны для доступа к полям класса и взаимодействия с ними.
	//Метод который возвращает значение геттер, а метод задающий новое значение сеттер.
	//Прямой доступ к полям класса- это плохой пример разработки кода.
	//Поля необходимо создавать недоступными за пределами класса.


	std::cout << "Задание №3\n";

	//Сокрытие реализации класса является неотъемлемой частью инкапсуляции.


}